Repository: Archeb/opentrace
Catalog: Properties/Resources.*.resx
Languages: es, fr, ja, ru, zh_cn, zh_tw

source: About...
es: Acerca de...
fr: À propos...
ja: OpenTrace について...
ru: О программе...
zh_cn: 关于
zh_tw: 關於

# ADDITIONAL_ARGS
source: Additional Arguments
es: Argumentos adicionales
fr: Arguments supplémentaires
ja: 追加の引数
ru: Дополнительные аргументы
zh_cn: 附加参数
zh_tw: 附加引數

# ASK_ADD_ICMP_FIREWALL_RULE
source: NextTrace needs certain types (11 and 3) of ICMP messages to fully trace routes. But Windows firewall blocks these ICMP by default, causing only the last hop to be displayed. Would you like to add a firewall rule to allow needed ICMP for NextTrace?
es: NextTrace necesita ciertos tipos (11 y 3) de mensajes ICMP para trazar rutas completas. Sin embargo, el cortafuegos de Windows bloquea estos mensajes por defecto, lo que provoca que solo se muestre el último salto. ¿Desea añadir una regla al cortafuegos para permitir los mensajes ICMP necesarios para NextTrace?
fr: NextTrace a besoin de certains types (11 et 3) de messages ICMP pour tracer complètement les itinéraires. Cependant, le pare-feu Windows bloque ces messages par défaut, ce qui n'affiche que le dernier saut. Souhaitez-vous ajouter une règle de pare-feu pour autoriser l'ICMP nécessaire à NextTrace ?
ja: NextTrace が完全なルート追跡を行うには、特定のタイプ（11 および 3）の ICMP メッセージを受信する必要があります。しかし、Windows ファイアウォールはデフォルトでこれらのメッセージをブロックするため、最終ホップのみが表示される原因となります。 NextTrace 用に、必要な ICMP を許可するファイアウォール規則を追加しますか？
ru: NextTrace требует ICMP-сообщения (типы 11 и 3) для полной трассировки. Брандмауэр Windows блокирует их по умолчанию, из-за чего виден только последний узел. Добавить правило в брандмауэр для корректной работы NextTrace?
zh_cn: NextTrace 需要接收特殊的 ICMP 响应报文来构建完整的 traceroute 信息；但默认情况下，Windows 防火墙会拦截此类消息，导致您只能看到 traceroute 的最后一跳。 您可以点击“是”来自动添加防火墙规则，也可以点“否”取消这一操作。 若要获得更多信息，请参考 https://github.com/nxtrace/Ntrace-core/issues/52
zh_tw: NextTrace需要型態3和11的ICMP封包來建立完整追蹤路徑。Windows 系統防火牆默認阻擋相關封包，以致只有最後一個節點會被顯示。 您希望NextTrace幫您增加防火牆例外規則以利運行嗎？ 若要獲得更多資訊，請參考 https://github.com/nxtrace/Ntrace-core/issues/52

source: (Auto Detect)
es: (Detección automática)
fr: (Détection automatique)
ja: (自動検出)
ru: (Автоопределение)
zh_cn: (留空自动检测)
zh_tw: (留空自動檢測)

# AVRG
source: Avg.
es: Prom.
fr: Moy.
ja: 平均
ru: Сред.
zh_cn: 平均延迟
zh_tw: 平均延遲

source: Best
es: Mejor
fr: Meilleur
ja: 最小
ru: Мин.
zh_cn: 最佳延迟
zh_tw: 最佳延遲

source: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ru: Отмена
zh_cn: 取消
zh_tw: 取消

source: CHUNZHEN Endpoint
es: Punto de acceso CHUNZHEN
fr: Point de terminaison CHUNZHEN
ja: Chunzhen API エンドポイント
ru: Эндпоинт CHUNZHEN
zh_cn: 纯真 API 端点
zh_tw: 純真 API 端點

source: Close
es: Cerrar
fr: Fermer
ja: 閉じる
ru: Закрыть
zh_cn: 关闭
zh_tw: 關閉

# COMBINE_GEO_ORG
source: Combine Geography and Organization into a single column
es: Combinar geolocalización y organización en una sola columna
fr: Combiner la géolocalisation et l'organisation en une seule colonne
ja: 地理位置情報と組織情報を 1 つの列にまとめる
ru: Объединить локацию и организацию в одну колонку
zh_cn: 把地理位置和组织信息合为一栏
zh_tw: 把地理位置和組織資訊合為一欄

source: Copy
es: Copiar
fr: Copier
ja: コピー
ru: Копировать
zh_cn: 复制
zh_tw: 拷貝

# CUSTOM_DNS_RESOLVERS
source: Custom DNS Resolvers (DNS / DoH Supported)
es: Resolutores DNS personalizados (Soporta DNS / DoH)
fr: DNS personnalisés (DNS / DoH)
ja: カスタム DNS (DNS / DoH)
ru: Свой DNS (UDP / DoH)
zh_cn: 自定义DNS服务器 (支持 UDP / DoH)
zh_tw: 自定義 DNS 解析器 (支援 UDP / DoH)

# DISABLE_IPGEO
source: Disabled
es: Desactivado
fr: Désactivé
ja: 無効
ru: Отключено
zh_cn: 禁用地理位置
zh_tw: 禁用地理位置

# DST_PORT_INIT_SEQ
source: Destination port / Initial seq
es: Puerto de destino / Secuencia inicial
fr: Port de destination / Séquence initiale
ja: 宛先ポート / 初期シーケンス番号
ru: Порт назн. / Нач. seq
zh_cn: 目标端口 / 初始序号
zh_tw: 目標埠 / 初始序號

# EMPTY_HOSTNAME_MSGBOX
source: Host or IP cannot be empty
es: El host o la IP no pueden estar vacíos
fr: L'hôte ou l'IP ne peut pas être vide
ja: ホスト名または IP アドレスを入力してください
ru: Узел или IP не могут быть пустыми
zh_cn: 主机或 IP 不能为空
zh_tw: 主機或 IP 不能為空

# ENABLE_IP2REGION
source: Enable offline database Ip2region (ip2region.db)
es: Activar base de datos offline Ip2region (ip2region.db)
ja: オフライン DB Ip2region (ip2region.db) を有効にする
ru: Включить офлайн-базу Ip2region (ip2region.db)
zh_cn: 启用 Ip2region 离线库 (ip2region.db)
zh_tw: 使用本地 Ip2region 數據庫 (ip2region.db)

# ENABLE_IPINFOLOCAL
source: Enable offline database IPInfo (ipinfoLocal.mmdb)
es: Activar base de datos offline IPInfo (ipinfoLocal.mmdb)
fr: Activer la base de données hors ligne IPInfo (ipinfoLocal.mmdb)
ja: オフライン DB IPInfo (ipinfoLocal.mmdb) を有効にする
ru: Включить офлайн-базу IPInfo (ipinfoLocal.mmdb)
zh_cn: 启用 IPInfo 离线库 (ipinfoLocal.mmdb)
zh_tw: 使用本地 IPInfo 數據庫 (ipinfoLocal.mmdb)

# ERR_MSG
source: Error Message
es: Mensaje de error
fr: Message d'erreur
ja: エラーメッセージ
ru: Сообщение об ошибке
zh_cn: 错误消息
zh_tw: 錯誤訊息

# ERR_WRITING_SETTINGS
source: Error writing app settings.
es: Error al escribir los ajustes de la aplicación.
fr: Erreur lors de l'écriture des paramètres de l'application.
ja: 設定の保存中にエラーが発生しました。
ru: Ошибка при записи настроек.
zh_cn: 保存设置时出错
zh_tw: 儲存設定時出錯

# EXCEPTIONAL_EXIT_MSG
source: NextTrace process exited unexpectedly. Please refer to the error message to learn more and report this issue to us. Exit Code:
es: El proceso NextTrace terminó inesperadamente. Por favor, consulte el mensaje de error para más información e infórmenos del problema. Código de salida:
fr: Le processus NextTrace s'est arrêté de manière inattendue. Veuillez vous référer au message d'erreur pour en savoir plus et nous signaler ce problème. Code de sortie :
ja: NextTrace プロセスが予期せず終了しました。詳細についてはエラーメッセージを確認し、問題を報告してください。終了コード:
ru: Процесс NextTrace неожиданно завершился. См. ошибку для подробностей. Код выхода:
zh_cn: NextTrace 进程异常退出，请参考错误消息以了解更多信息并及时向我们报告此问题。 退出代码：
zh_tw: NextTrace 程序異常退出，請參考錯誤訊息以瞭解更多資訊並及時向我們報告此問題。 退出程式碼：

# EXC_OUTPUT_FORM_PROMPT
source: NextTrace generated one or more unexpected outputs during runtime. Please check the output below for troubleshooting. You can refer to the NextTrace Wiki to see if there is already an answer; if you cannot find the answer, please report it to us.
es: NextTrace generó una o más salidas inesperadas durante la ejecución. Por favor, revise la salida a continuación para solucionar el problema. Puede consultar la Wiki de NextTrace para ver si ya existe una solución; si no la encuentra, por favor infórmenos.
fr: NextTrace a généré une ou plusieurs sorties inattendues. Veuillez vérifier la sortie ci-dessous pour le dépannage. Vous pouvez consulter le Wiki de NextTrace pour voir si une réponse existe déjà ; si vous ne trouvez pas la réponse, veuillez nous le signaler.
ja: NextTrace の実行中に 1 つ以上の予期しない出力が生成されました。トラブルシューティングのために以下の出力を確認してください。NextTrace Wiki に既に解決策があるか確認し、解決しない場合は問題を報告してください。
ru: NextTrace выдал неожиданный результат. Проверьте данные ниже для устранения неполадок или обратитесь к NextTrace Wiki.
zh_cn: NextTrace 产生了一个或多个异常输出，请检查下面的输出信息以排查问题。您可以参考 NextTrace Wiki 来查看是否已经有解答；如未能找到答案，请向我们报告。
zh_tw: NextTrace 產生了一個或多個異常輸出，請檢查下面的輸出資訊以排查問題。 您可以參考 NextTrace Wiki 來查看是否已經有解答；如未能找到答案，請向我們報告。

# EXC_OUTPUT_FORM_REPORT
source: Report this issue
es: Informar de este problema
fr: Signaler ce problème
ja: 問題を報告する
ru: Сообщить об ошибке
zh_cn: 报告问题
zh_tw: 報告問題

# EXC_OUTPUT_FORM_TITLE
source: Unexpected Output
es: Salida inesperada
fr: Sortie inattendue
ja: 予期しない出力
ru: Неожиданный вывод
zh_cn: 异常输出
zh_tw: 異常輸出

# EXE_PATH
source: Executable Path
es: Ruta del ejecutable
fr: Chemin de l'exécutable
ja: 実行ファイルのパス
ru: Путь к файлу
zh_cn: 可执行文件路径
zh_tw: 可執行檔案路徑

source: Export
es: Exportar
fr: Exporter
ja: エクスポート
ru: Экспорт
zh_cn: 导出
zh_tw: 匯出

source: Export To
es: Exportar a
fr: Exporter vers
ja: 名前を付けてエクスポート
ru: Экспортировать в
zh_cn: 导出为
zh_tw: 匯出為

# FAILED_TO_ADD_RULES
source: Failed to add firewall rules.
es: Error al añadir reglas al cortafuegos.
fr: Échec de l'ajout des règles de pare-feu.
ja: ファイアウォール規則の追加に失敗しました。
ru: Не удалось добавить правила брандмауэра.
zh_cn: 添加防火墙规则失败
zh_tw: 新增防火墻規則失敗

source: File
es: Archivo
fr: Fichier
ja: ファイル
ru: Файл
zh_cn: 文件
zh_tw: 檔案

source: First TTL Hop
es: Primer salto TTL
fr: Premier saut TTL
ja: 開始ホップ数 (TTL)
ru: Первый узел (TTL)
zh_cn: 首个跃点
zh_tw: 首個躍點

source: General
fr: Général
ja: 全般設定
ru: Общие
zh_cn: 常规设置
zh_tw: 常規設定

source: Geolocation
es: Geolocalización
fr: Géolocalisation
ja: 地理位置情報
ru: Геопозиция
zh_cn: 地理位置
zh_tw: 地理位置

# GRID_SIZE_RATIO
source: Grid Height Ratio
es: Relación de altura de cuadrícula
fr: Ratio de hauteur de la grille
ja: グリッドの高さの比率
ru: Высота таблицы
zh_cn: 表格高度占比
zh_tw: 表格高度占比

source: Help
es: Ayuda
fr: Aide
ja: ヘルプ
ru: Справка
zh_cn: 帮助
zh_tw: 幫助

# HIDE_ADD_FIREWALL_PROMPT
source: Hide the prompt to add firewall rules
es: Ocultar el aviso para añadir reglas al cortafuegos
fr: Masquer l'invite d'ajout de règles de pare-feu
ja: ファイアウォール規則追加の確認を非表示にする
ru: Не предлагать настройку брандмауэра
zh_cn: 不再提示添加防火墙规则
zh_tw: 不再提示新增防火牆規則

# HIDE_MAP_POPUP
source: Hide the map's info windows
es: Ocultar ventanas de información del mapa
fr: Masquer les fenêtres d'info de la carte
ja: 地図上の情報ウィンドウを非表示にする
ru: Скрыть инфо-окна на карте
zh_cn: 隐藏地图上的信息窗口
zh_tw: 隱藏地圖上的資訊視窗

source: History
es: Historial
fr: Historique
ja: 履歴
ru: История
zh_cn: 历史记录
zh_tw: 歷史記錄

source: Hostname
es: Nombre de host
fr: Nom d'hôte
ja: ホスト名
ru: Имя хоста
zh_cn: 主机名
zh_tw: 主機名

# IPINFO_TOKEN
source: IPInfo Token (Optional)
es: Token de IPInfo (Opcional)
fr: Token IPInfo (Optionnel)
ja: IPInfo トークン (任意)
ru: Токен IPInfo (опц.)
zh_cn: IPInfo Token (可选)
zh_tw: IPInfo Token (可選)

# IP_GEO_DATA_PROVIDER
source: IP Geograph Data Provider
es: Proveedor de datos de geolocalización IP
fr: Fournisseur de données de géolocalisation IP
ja: IP 地理位置情報プロバイダー
ru: Провайдер геоданных
zh_cn: IP 地理位置数据源
zh_tw: IP 地理位置資料來源

# LANGUAGE
source: Language (语言)
es: Idioma (Language)
fr: Langue (Language)
ja: 言語 (Language)
ru: Язык (Language)
zh_tw: Language (語言)

source: Last
es: Último
fr: Dernier
ja: 現在
ru: Тек.
zh_cn: 当前延迟
zh_tw: 當前延遲

# LEOMOEAPI_HOSTPORT
source: LeoMoeAPI Reverse Proxy
es: Proxy inverso LeoMoeAPI
fr: Proxy inverse LeoMoeAPI
ja: LeoMoeAPI リバースプロキシ
ru: Прокси LeoMoeAPI
zh_cn: LeoMoeAPI 反代地址
zh_tw: LeoMoeAPI 反代地址

# LINKLOCAL_ADDR
source: Link-local Address
es: Dirección de enlace local
fr: Adresse de lien local
ja: リンクローカルアドレス
ru: Link-local адрес
zh_cn: 链路本地地址
zh_tw: 鏈路本地地址

# LOCAL_MMDB
source: Local MMDB Overwrite
es: Sobrescribir con MMDB local
fr: Remplacement MMDB local
ja: ローカル MMDB 上書き
ru: Локальная MMDB (перезапись)
zh_cn: 本地 MMDB 覆写
zh_tw: 本地 MMDB

# LOCAL_MMDB_ADDR
source: Address Template
es: Plantilla de dirección
fr: Modèle d'adresse
ja: 住所テンプレート
ru: Шаблон адреса
zh_cn: 地理位置模板
zh_tw: 地理位置模板

# LOCAL_MMDB_ASN
source: ASN Template
es: Plantilla de ASN
fr: Modèle ASN
ja: ASN テンプレート
ru: Шаблон ASN
zh_cn: ASN 模板
zh_tw: ASN 模板

# LOCAL_MMDB_HOSTNAME
source: Hostname Template
es: Plantilla de nombre de host
fr: Modèle de nom d'hôte
ja: ホスト名テンプレート
ru: Шаблон хоста
zh_cn: 主机名模板
zh_tw: 主機名模板

# LOCAL_MMDB_LAT
source: Latitude Template
es: Plantilla de latitud
fr: Modèle de latitude
ja: 緯度テンプレート
ru: Шаблон широты
zh_cn: 纬度模板
zh_tw: 緯度模板

# LOCAL_MMDB_LON
source: Longitude Template
es: Plantilla de longitud
fr: Modèle de longitude
ja: 経度テンプレート
ru: Шаблон долготы
zh_cn: 经度模板
zh_tw: 經度模板

# LOCAL_MMDB_ORG
source: Organization Template
es: Plantilla de organización
fr: Modèle d'organisation
ja: 組織テンプレート
ru: Шаблон организации
zh_cn: 组织模板
zh_tw: 組織模板

source: Local MMDB Path
es: Ruta de MMDB local
fr: Chemin MMDB local
ja: ローカル MMDB パス
ru: Путь к MMDB
zh_cn: 本地 MMDB 路径
zh_tw: 本地 MMDB 路徑

# LOCAL_MMDB_PRESETS
source: Presets
es: Preajustes
fr: Préréglages
ja: プリセット
ru: Пресеты
zh_cn: 预设配置
zh_tw: 預設配置

# LOCAL_MMDB_PREVIEW
source: Preview MMDB File
es: Vista previa del archivo MMDB
fr: Prévisualiser le fichier MMDB
ja: MMDB ファイルのプレビュー
ru: Предпросмотр MMDB
zh_cn: 预览 MMDB
zh_tw: 預覽 MMDB

# LOCAL_MMDB_PREVIEW_IP
source: Preview MMDB IP
es: Vista previa de IP de MMDB
fr: Prévisualiser l'IP MMDB
ja: プレビュー用 IP
ru: IP для предпросмотра
zh_cn: 预览 IP
zh_tw: 預覽 IP

# LOCAL_MMDB_SELECT
source: Select MMDB File
es: Seleccionar archivo MMDB
fr: Sélectionner un fichier MMDB
ja: MMDB ファイルを選択
ru: Выбрать MMDB
zh_cn: 选择 MMDB 文件
zh_tw: 選擇 MMDB 檔案

# LOCAL_MMDB_TIPS
source: Use MMDB query result overwrite original result Leave empty to avoid overwrite field Template Example: {.country}-{.city}
es: Usa los resultados de la consulta MMDB para sobrescribir los originales. Deja vacío para evitar sobrescribir el campo. Ejemplo de plantilla: {.country}-{.city}
fr: Utilise le résultat de la requête MMDB locale pour écraser le résultat original. Laissez vide pour éviter d'écraser le champ. Exemple de modèle : {.country}-{.city}
ja: MMDB のクエリ結果で元の結果を上書きします。 フィールドを上書きしない場合は空欄にしてください。 テンプレート例: {.country}-{.city}
ru: Использование MMDB для замены данных. Оставьте пустым, чтобы не менять поле. Пример: {.country}-{.city}
zh_cn: 此功能用本地 MMDB 查询的结果覆盖原查询结果 留空以避免覆写对应字段 模板举例: {.country}-{.city}
zh_tw: 此功能用本地 MMDB 查詢的結果覆蓋原查詢結果 留空以避免覆寫對應欄位 模板舉例: {.country}-{.city}

# LOOPBACK_ADDR
source: Loopback Address
es: Dirección de bucle de retorno (Loopback)
fr: Adresse de bouclage (Loopback)
ja: ループバックアドレス
ru: Loopback адрес
zh_cn: 本地回环地址
zh_tw: 本地迴環地址

source: Loss%
es: % Pérdida
fr: Perte %
ja: 損失%
ru: Потери%
zh_cn: 丢包率%
zh_tw: 丟包率%

source: Map Provider
es: Proveedor de mapas
fr: Fournisseur de carte
ja: 地図プロバイダー
ru: Карты
zh_cn: 地图数据源
zh_tw: 地圖資料來源

# MAP_PROVIDER_BAIDU
source: Baidu Maps
ja: 百度地図 (Baidu Maps)
zh_cn: 百度地图
zh_tw: 百度地圖

# MAP_PROVIDER_GOOGLE
source: Google Maps
ja: Google マップ
zh_cn: 谷歌地图
zh_tw: 谷歌地圖

source: Max Hops
es: Saltos máximos
fr: Sauts max
ja: 最大ホップ数
ru: Макс. узлов
zh_cn: 最大跃点
zh_tw: 最大躍點

# MISSING_COMP
source: Missing Component
es: Componente faltante
fr: Composant manquant
ja: コンポーネントが見つかりません
ru: Компонент отсутствует
zh_cn: 组件缺失
zh_tw: 元件缺失

# MISSING_COMP_TEXT
source: OpenTrace requires the NextTrace utility to function properly. This executable is currently missing. NextTrace can be placed in either: 1. The same directory as the OpenTrace executable OR 2. A directory included in your system's PATH environment variable Would you like to download the NextTrace utility now?
es: OpenTrace requiere la utilidad NextTrace para funcionar correctamente. El ejecutable no se ha encontrado. Puede colocar NextTrace en: 1. El mismo directorio que el ejecutable de OpenTrace O 2. Un directorio incluido en la variable de entorno PATH del sistema ¿Desea descargar la utilidad NextTrace ahora?
fr: OpenTrace a besoin de l'utilitaire NextTrace pour fonctionner correctement. Cet exécutable est actuellement manquant. NextTrace peut être placé dans : 1. Le même répertoire que l'exécutable OpenTrace OU 2. Un répertoire inclus dans la variable d'environnement PATH de votre système Souhaitez-vous télécharger l'utilitaire NextTrace maintenant ?
ja: OpenTrace が正常に動作するには NextTrace ユーティリティが必要です。現在、この実行ファイルが見つかりません。 NextTrace は以下のいずれかに配置してください： 1. OpenTrace 実行ファイルと同じディレクトリ または 2. システムの PATH 環境変数に含まれるディレクトリ 今すぐ NextTrace ユーティリティをダウンロードしますか？
ru: Для работы OpenTrace нужна утилита NextTrace. Файл не найден. Поместите NextTrace в: 1. Папку с программой ИЛИ 2. Директорию из системного PATH Скачать утилиту сейчас?
zh_cn: OpenTrace 需要 NextTrace 才能正常工作，但未能找到可执行文件。 您可以把 NextTrace 可执行文件放置于： 1. 与 OpenTrace 同一目录下 或 2. PATH 环境变量中的目录下 是否现在下载 NextTrace？
zh_tw: OpenTrace 需要 NextTrace 才能正常工作，但未能找到可執行檔案。 您可以把 NextTrace 可執行檔案放置於： 1. 與 OpenTrace 同一目錄下 或 2. PATH 環境變數中的目錄下 是否現在下載 NextTrace？

# MISSING_COMP_TEXT_MACOS
source: OpenTrace requires the NextTrace utility to function properly. This executable is currently missing. Please download NextTrace and set the permissions as follows: sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace And specify the path in the settings. Would you like to download the NextTrace utility now?
es: OpenTrace requiere la utilidad NextTrace para funcionar correctamente. El ejecutable no se ha encontrado. Por favor, descargue NextTrace y establezca los permisos de la siguiente manera: sudo xattr -r -d com.apple.quarantine /ruta/a/nexttrace sudo chown root:admin /ruta/a/nexttrace sudo chmod +sx /ruta/a/nexttrace Y especifique la ruta en los ajustes. ¿Desea descargar la utilidad NextTrace ahora?
fr: OpenTrace a besoin de l'utilitaire NextTrace pour fonctionner correctement. Cet exécutable est actuellement manquant. Veuillez télécharger NextTrace et définir les permissions comme suit : sudo xattr -r -d com.apple.quarantine /chemin/vers/nexttrace sudo chown root:admin /chemin/vers/nexttrace sudo chmod +sx /chemin/vers/nexttrace Puis spécifiez le chemin dans les paramètres. Souhaitez-vous télécharger l'utilitaire NextTrace maintenant ?
ja: OpenTrace が正常に動作するには NextTrace ユーティリティが必要です。現在、この実行ファイルが見つかりません。 NextTrace をダウンロードし、以下の権限を設定してください： sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace その後、設定でパスを指定してください。 今すぐ NextTrace ユーティリティをダウンロードしますか？
ru: Файл NextTrace не найден. Скачайте его и настройте права доступа: sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace И укажите путь в настройках. Скачать сейчас?
zh_cn: OpenTrace 需要 NextTrace 才能正常工作，但未能找到可执行文件。 请下载 NextTrace 并设置好权限： sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace 然后在设置中指定 NextTrace 路径。 是否现在下载 NextTrace？
zh_tw: OpenTrace 需要 NextTrace 才能正常工作，但未能找到可執行檔案。 請下載 NextTrace 並設定好權限： sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace 然後在設定中指定 NextTrace 路徑。 是否現在下載 NextTrace？

# MISSING_COMP_PRIV_MACOS
source: OpenTrace requires privileges to perform TCP/UDP trace. Please set the permissions of NextTrace as follows: sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace
es: OpenTrace requiere privilegios para realizar el trazado TCP/UDP. Por favor, establezca los permisos de NextTrace de la siguiente manera: sudo xattr -r -d com.apple.quarantine /ruta/a/nexttrace sudo chown root:admin /ruta/a/nexttrace sudo chmod +sx /ruta/a/nexttrace
fr: OpenTrace nécessite des privilèges pour effectuer des traces TCP/UDP. Veuillez définir les permissions de NextTrace comme suit : sudo xattr -r -d com.apple.quarantine /chemin/vers/nexttrace sudo chown root:admin /chemin/vers/nexttrace sudo chmod +sx /chemin/vers/nexttrace
ja: OpenTrace が TCP/UDP トレースを実行するには権限が必要です。 NextTrace の権限を以下のように設定してください： sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace
ru: Требуются права для трассировки TCP/UDP. Настройте разрешения: sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace
zh_cn: OpenTrace 需要权限才能进行 TCP/UDP 追踪。 请为 NextTrace 设置权限: sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace
zh_tw: OpenTrace 需要權限才能進行 TCP/UDP 追蹤。 請為 NextTrace 設置權限: sudo xattr -r -d com.apple.quarantine /path/to/nexttrace sudo chown root:admin /path/to/nexttrace sudo chmod +sx /path/to/nexttrace

# MISSING_PRIV_MACOS
source: OpenTrace requires privileges to perform TCP/UDP trace
es: OpenTrace requiere privilegios para realizar el trazado TCP/UDP
fr: OpenTrace nécessite des privilèges pour effectuer des traces TCP/UDP
ja: OpenTrace が TCP/UDP トレースを実行するには権限が必要です
ru: Требуются права для TCP/UDP трассировки
zh_cn: OpenTrace 需要权限才能进行 TCP/UDP 追踪
zh_tw: OpenTrace 需要權限才能進行 TCP/UDP 追蹤

# MISSING_SPECIFIED_COMP
source: NextTrace could not be found in "{0}".
es: No se pudo encontrar NextTrace en "{0}".
fr: NextTrace n'a pas pu être trouvé dans "{0}".
ja: "{0}" に NextTrace が見つかりませんでした。
ru: NextTrace не найден по пути "{0}".
zh_cn: 未能在指定的位置 "{0}" 中找到 NextTrace。
zh_tw: 未能在指定的位置 "{0}" 中找到 NextTrace。

source: MTR Mode
es: Modo MTR
fr: Mode MTR
ja: MTR モード
ru: Режим MTR
zh_cn: MTR 模式
zh_tw: MTR 模式

# NAME_NOT_RESOLVED
source: Could not find host {0}. Please check the name and try again.
es: No se pudo encontrar el host {0}. Por favor, compruebe el nombre e inténtelo de nuevo.
fr: Impossible de trouver l'hôte {0}. Veuillez vérifier le nom et réessayer.
ja: ホスト {0} が見つかりませんでした。入力内容を確認して再試行してください。
ru: Не удалось найти хост {0}. Проверьте имя и повторите попытку.
zh_cn: 找不到主机 {0}。请检查该名称，然后重试。
zh_tw: 找不到主機 {0}。請檢查該名稱，然後重試。

source: New
es: Nuevo
fr: Nouveau
ja: 新規作成
ru: Создать
zh_cn: 新建
zh_tw: 新建

# NEW_WINDOW_TEXT
source: Create a new OpenTrace window.
es: Crear una nueva ventana de OpenTrace.
fr: Créer une nouvelle fenêtre OpenTrace.
ja: 新しい OpenTrace ウィンドウを開きます。
ru: Открыть новое окно OpenTrace.
zh_cn: 打开一个新的 OpenTrace 窗口
zh_tw: 開啟一個新的 OpenTrace 視窗

# NEXTTRACE_PROXY
source: Proxy
ja: プロキシ
ru: Прокси
zh_cn: 代理设置

# RDNS_MODE
source: Reverse DNS Lookup Mode
es: Modo de búsqueda DNS inversa
fr: Mode de recherche DNS inversée (rDNS)
ja: 逆引き DNS クエリモード
ru: Режим Reverse DNS
zh_cn: 反向 DNS 查询模式
zh_tw: 反向 DNS 查找模式

source: Organization
es: Organización
fr: Organisation
ja: 組織
ru: Организация
zh_cn: 组织
zh_tw: 組織

# OTHER_DATABASE_TIPS
source: Some data sources can only be selected after setting up an API endpoint/token. To use an offline database, please refer to the NextTrace documentation to set it up.
es: Algunas fuentes de datos solo pueden seleccionarse tras configurar un punto de acceso API o token. Para usar una base de datos offline, consulte la documentación de NextTrace para configurarla.
fr: Certaines sources de données nécessitent un point de terminaison API/token. Pour les bases de données hors ligne, voir la documentation de NextTrace.
ja: 一部のデータソースには API エンドポイント/トークンが必要です。 オフラインデータベースについては NextTrace のドキュメントを参照してください。
ru: Для некоторых баз нужен API-токен. См. документацию NextTrace для офлайн-баз.
zh_cn: 部分数据源只有在设置了 API 端点 / Token 之后才可被选择； 若要使用离线数据库，请参考 NextTrace 文档进行设置。
zh_tw: 有些數據源只有在設置 API 端點 / Token 後才能選擇； 要使用離線數據庫，請參閱 NextTrace 文檔進行設置。

source: Packet Group Interval
es: Intervalo de grupo de paquetes
fr: Intervalle de groupe de paquets
ja: パケットグループの間隔
ru: Интервал групп пакетов
zh_cn: 分组请求间隔
zh_tw: 分組請求間隔

source: Packet Interval
es: Intervalo entre paquetes
fr: Intervalle entre les paquets
ja: パケットの間隔
ru: Интервал пакетов
zh_cn: 请求间隔
zh_tw: 請求間隔

# PARALLEL_REQ
source: Parallel Requests
es: Peticiones paralelas
fr: Requêtes parallèles
ja: 並列リクエスト数
ru: Параллельные запросы
zh_cn: 并行请求数
zh_tw: 並行請求數

# POW_PROVIDER
source: LeoMoeAPI PoW Provider
es: Proveedor PoW de LeoMoeAPI
fr: Fournisseur PoW LeoMoeAPI
ja: LeoMoeAPI PoW プロバイダー
ru: LeoMoeAPI PoW провайдер
zh_cn: LeoMoeAPI PoW 服务器
zh_tw: LeoMoeAPI PoW 伺服器

# POW_PROVIDER_LEOMOE
source: api.leo.moe (Default)
es: api.leo.moe (Por defecto)
fr: api.leo.moe (Défaut)
ja: api.leo.moe (デフォルト)
ru: api.leo.moe (По умолчанию)
zh_cn: api.leo.moe (默认)
zh_tw: api.leo.moe (默認)

# POW_PROVIDER_SAKURA
source: Nya Labs (China Mainland Optimized)
es: Nya Labs (Optimizado para China Continental)
fr: Nya Labs (Optimisé pour la Chine continentale)
ja: Nya Labs (中国本土最適化)
ru: Nya Labs (Оптимизация для Китая)
zh_cn: Nya Labs (中国大陆优化)
zh_tw: Nya Labs (中國大陸優化)

source: Preferences
es: Preferencias
fr: Préférences
ja: 設定
ru: Настройки
zh_cn: 设置
zh_tw: 設定

# PRIVATE_ADDR
source: Private Address (LAN)
es: Dirección privada (LAN)
fr: Adresse privée (LAN)
ja: プライベートアドレス (LAN)
ru: Частный адрес (LAN)
zh_cn: 私有地址（局域网）
zh_tw: 私有地址（區域網）

source: Protocol for tracerouting
es: Protocolo para traceroute
fr: Protocole pour le traceroute
ja: トレースに使用するプロトコル
ru: Протокол трассировки
zh_cn: Traceroute 使用的协议
zh_tw: Traceroute 使用的協議
