Repository: Archeb/opentrace
Catalog: Properties/Resources.*.resx
Languages: es, fr, ja, ru, zh_cn, zh_tw

# QUERIES_SETTING
source: Queries (probes per each hop)
es: Consultas (sondas por cada salto)
fr: Requêtes (sondes par saut)
ja: クエリ数 (各ホップの試行回数)
ru: Проб на узел
zh_cn: 每跃点探测次数
zh_tw: 每躍點探測次數

source: Quit
es: Salir
fr: Quitter
ja: 終了
ru: Выйти
zh_cn: 退出
zh_tw: 退出

source: Recv
fr: Recus
ja: 受信数
ru: Получ.
zh_cn: 接收数
zh_tw: 接收數

# RESTART_TO_APPLY
source: Some settings will not be applied before the application is restarted
es: Algunos ajustes no se aplicarán hasta que se reinicie la aplicación
fr: Certains changements nécessitent un redémarrage.
ja: 一部の変更を適用するには再起動が必要です。
ru: Нужен перезапуск для применения.
zh_cn: 部分设置需重启应用才能生效
zh_tw: 部分設定需重啟應用才能生效

source: Save
es: Guardar
fr: Enregistrer
ja: 保存
ru: Сохранить
zh_cn: 保存
zh_tw: 儲存

# SELECT_IP_DROPDOWN
source: Select an IP
es: Seleccione una IP
fr: Sélectionner une IP
ja: IP を選択
ru: Выберите IP
zh_cn: 选择一个 IP
zh_tw: 選擇一個 IP

# SELECT_IP_MSGBOX
source: Please select an IP from the dropdown.
es: Por favor, seleccione una IP del menú desplegable.
fr: Veuillez sélectionner une IP dans la liste déroulante.
ja: ドロップダウンから IP を選択してください。
ru: Пожалуйста, выберите IP из списка.
zh_cn: 请从下拉菜单中选择一个 IP
zh_tw: 請從下拉選單中選擇一個 IP

source: Sent
es: Enviados
fr: Envoyés
ja: 送信数
ru: Отпр.
zh_cn: 已发送
zh_tw: 已傳送

# SHARED_ADDR
source: Shared Address
es: Dirección compartida
fr: Adresse partagée
ja: シェアードアドレス
ru: Общий адрес
zh_cn: 共享地址
zh_tw: 共享地址

# SRC_ADDR_SETTING
source: Source Address
es: Dirección de origen
fr: Adresse source
ja: ソースアドレス
ru: Исходный адрес
zh_cn: 源地址
zh_tw: 源地址

# SRC_INTERFACE_SETTING
source: Source Interface
es: Interfaz de origen
fr: Interface source
ja: ソースインターフェース
ru: Исходный интерфейс
zh_cn: 源接口
zh_tw: 源介面

source: Start
es: Iniciar
fr: Démarrer
ja: 開始
ru: Старт
zh_cn: 开始
zh_tw: 開始

# STDEV
source: Std. Dev.
es: Desv. Est.
fr: Écart-type
ja: 標準偏差
ru: Ст. откл.
zh_cn: 标准差
zh_tw: 標準差

source: Stop
es: Detener
fr: Arrêter
ja: 停止
ru: Стоп
zh_cn: 停止
zh_tw: 停止

# SYSTEM_DNS_RESOLVER
source: System DNS
es: DNS del sistema
fr: DNS système
ja: システム DNS
ru: Системный DNS
zh_cn: 系统 DNS
zh_tw: 系統 DNS

source: Time(ms)
es: Tiempo(ms)
fr: Temps (ms)
ja: 時間(ms)
ru: Время (мс)
zh_cn: 时间(ms)
zh_tw: 時間(ms)

# TIME_ROUNDING
source: Round hop latency to whole number
es: Redondear latencia del salto a un número entero
fr: Arrondir la latence du saut à l'entier le plus proche
ja: ホップの遅延を整数に丸める
ru: Округлять задержку до целых
zh_cn: 保留延迟显示到整数位
zh_tw: 保留延遲顯示到整數位

source: Tracerouting
es: Rastreo de ruta (Traceroute)
fr: Traceroute
ja: ルート追跡 (Tracerouting)
ru: Трассировка
zh_cn: 路由追踪
zh_tw: 路由追蹤

source: Worst
es: Peor
fr: Pire
ja: 最大
ru: Макс.
zh_cn: 最大延迟
zh_tw: 最大延遲

# MACOS_QUARANTINE
source: OpenTrace is quarantined by macOS, something may be inoperative. Please release OpenTrace as follows: sudo xattr -r -d com.apple.quarantine <drag and drop OpenTrace here> And restart OpenTrace after execution.
es: OpenTrace está en cuarentena por macOS, es posible que algunas funciones no operen. Por favor, libere OpenTrace de la siguiente manera: sudo xattr -r -d com.apple.quarantine <arrastre y suelte OpenTrace aquí> Y reinicie OpenTrace tras la ejecución.
fr: OpenTrace est mis en quarantaine par macOS, certaines fonctions peuvent être inopérantes. Veuillez libérer OpenTrace comme suit : sudo xattr -r -d com.apple.quarantine <glissez et déposez OpenTrace ici> Et redémarrez OpenTrace après l'exécution.
ja: OpenTrace が macOS によって隔離されているため、一部の機能が動作しない可能性があります。 以下の手順で解除してください： sudo xattr -r -d com.apple.quarantine <ここに OpenTrace をドラッグ＆ドロップ> 実行後、OpenTrace を再起動してください。
ru: OpenTrace находится в карантине macOS. Для разблокировки выполните в терминале: sudo xattr -r -d com.apple.quarantine [перетащите OpenTrace сюда] И перезапустите приложение.
zh_cn: OpenTrace 被 macOS 隔离，工作可能不完全正常。 请打开终端，使用下面的命令释放 OpenTrace: sudo xattr -r -d com.apple.quarantine <将 OpenTrace 拖放至此> 并在完成释放后重启 OpenTrace.
zh_tw: OpenTrace 被 macOS 隔離，工作可能不完全正常。 請開啟終端，使用下面的命令釋放 OpenTrace: sudo xattr -r -d com.apple.quarantine <將 OpenTrace 拖放至此> 並在完成釋放後重啟 OpenTrace.

source: Homepage
es: Página principal
fr: Page d'accueil
ja: ホームページ
ru: Домашняя страница
zh_cn: 项目主页
zh_tw: 項目主頁

# RDNS_MODE_ALWAYS
source: Attempt to Retrieve Full rDNS
es: Intentar obtener rDNS completo
fr: Tenter de récupérer le rDNS complet
ja: 完全な rDNS の取得を試行
ru: Пытаться получить полный rDNS
zh_cn: 尝试获取完整 rDNS
zh_tw: 嘗試擷取完整 rDNS

# RDNS_MODE_DEFAULT
source: Fast rDNS (Default)
es: rDNS rápido (Por defecto)
fr: rDNS Rapide (Défaut)
ja: 高速 rDNS (デフォルト)
ru: Быстрый rDNS (по умолчанию)
zh_cn: 快速 rDNS（默认）
zh_tw: 快速 rDNS（預設）

# RDNS_MODE_DISABLE
source: Disable rDNS Query
es: Desactivar consulta rDNS
fr: Désactiver la requête rDNS
ja: rDNS クエリを無効化
ru: Отключить rDNS-запросы
zh_cn: 禁用 rDNS 查询
zh_tw: 禁用 rDNS 查詢

source: Check update on startup
es: Buscar actualizaciones al inicio
fr: Vérifier les mises à jour au démarrage
ja: 起動時にアップデートを確認する
ru: Проверять обновления при запуске
zh_cn: 启动时检查更新
zh_tw: 啟動時檢查更新

# DOWNLOAD_LATEST
source: Download latest OpenTrace
es: Descargar la última versión de OpenTrace
fr: Télécharger la dernière version d'OpenTrace
ja: 最新の OpenTrace をダウンロード
ru: Скачать последнюю версию
zh_cn: 下载最新版 OpenTrace
zh_tw: 下載最新版 OpenTrace

# UPDATE_AVAILABLE
source: (Version {0} now available. Download it from the Help menu.)
es: (Versión {0} disponible. Descárguela desde el menú Ayuda.)
fr: (Version {0} disponible. Téléchargez-la depuis le menu Aide.)
ja: (バージョン {0} が利用可能です。ヘルプメニューからダウンロードしてください)
ru: (Доступна версия {0}. См. меню «Справка».)
zh_cn: (最新版 {0} 已发布，可到帮助菜单下载)
zh_tw: (最新版 {0} 已釋出，可到幫助選單下載)

source: Privacy Masking
es: Enmascaramiento de privacidad
fr: Masquage de confidentialité
ja: プライバシー保護
ru: Маскировка данных
zh_cn: 隐私保护
zh_tw: 私隱保護

# PRIVACY_MASKING_DESCR
source: Protect the first
es: Proteger los primeros
fr: Masquer les premiers
ja: 最初の
ru: Скрывать первые
zh_cn: 打码前
zh_tw: 隱藏前

# PRIVACY_MASKING_ALL
source: hops by masking all info
es: saltos ocultando toda la información
fr: infos des sauts
ja: ホップの全情報をマスク
ru: данные узлов
zh_cn: 跳的所有信息
zh_tw: 跳的所有訊息

# PRIVACY_MASKING_IP_FULL
source: hops by fully masking IP
es: saltos ocultando la IP completa
fr: IP complètes des sauts
ja: ホップの完全な IP をマスク
ru: полный IP узлов
zh_cn: 跳的完整 IP
zh_tw: 跳的完整 IP

# PRIVACY_MASKING_IP_GEO
source: hops by masking IP and Geo
es: saltos ocultando la IP y geolocalización
fr: IP et Géo des sauts
ja: ホップの IP と位置情報をマスク
ru: IP и локацию узлов
zh_cn: 跳的 IP 和地理位置
zh_tw: 跳的 IP 與地理位置

# PRIVACY_MASKING_IP_HALF
source: hops by partially masking IP
es: saltos ocultando parcialmente la IP
fr: IP partielles des sauts
ja: ホップの部分的な IP をマスク
ru: часть IP узлов
zh_cn: 跳的部分 IP
zh_tw: 跳的部分 IP

# WINDOWS_TCP_UDP_UNSUPPORTED
source: TCP/UDP Traceroute is not yet supported on Windows.
zh_cn: Windows 暂不支持 TCP/UDP Traceroute
zh_tw: Windows 暫不支援 TCP/UDP Traceroute
